Revit 2026 API

# WaterWaterTintColor Property

---

The property labeled "Custom Color" from the "Water" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WaterTintColor { get; }
```
```vb
Public Shared ReadOnly Property WaterTintColor As String
	Get
```
```cpp
public:
static property String^ WaterTintColor {
	String^ get ();
}
```
```fsharp
static member WaterTintColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Water Class

Autodesk.Revit.DB.Visual Namespace